src/cf/Catalogs/инт_Эндпоинты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>инт_Эндпоинты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресРесурса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипАвторизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.инт_ТипыАвторизации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверятьSSL</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаймаутСоединения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/инт_ТипыАвторизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>инт_ТипыАвторизации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Basic</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Bearer</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Tls</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Анонимный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Digest</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ApiKey</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/инт_Эндпоинты/Forms/ФормаЭлемента/Ext/Form/Module.bsl
// BSLLS:Typo-off
////////////////////////////////////////////////////////////////////////////////
// инт_Эндпоинты.ФормаЭлемента
//  
////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияИзБезопасногоХранилища();
	УстановитьТипАвторизацииПоУмолчанию();
	ОбновитьВидимостьСтраницАвторизацииНаСервере();
	ОбновитьВидимостьГруппСертификатаНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Формируем наименование автоматически: "ТипАвторизации: Адрес"
	ТипАвторизацииСтр = Строка(ТекущийОбъект.ТипАвторизации);
	Если ПустаяСтрока(ТипАвторизацииСтр) Тогда
		ТипАвторизацииСтр = "Анонимный";
	КонецЕсли;
	
	Адрес = ТекущийОбъект.АдресРесурса;
	Если СтрДлина(Адрес) > 50 Тогда
		Адрес = Лев(Адрес, 50) + "...";
	КонецЕсли;
	
	ТекущийОбъект.Description = СтрШаблон("[%1] %2", ТипАвторизацииСтр, Адрес);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	СохранитьДанныеВБезопасноеХранилище(ТекущийОбъект.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипАвторизацииПриИзменении(Элемент)
	
	ОбновитьВидимостьСтраницАвторизации();
	ОбновитьВидимостьГруппСертификата();
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура Basic_ПарольПриИзменении(Элемент)
	
	Basic_ПарольИзменен = Истина;
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура Digest_ПарольПриИзменении(Элемент)
	
	Digest_ПарольИзменен = Истина;
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура Bearer_ТокенПриИзменении(Элемент)
	
	Bearer_ТокенИзменен = Истина;
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура Tls_ИсточникСертификатаПриИзменении(Элемент)
	
	ОбновитьВидимостьГруппСертификата();
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура Tls_СертификатПриИзменении(Элемент)
	
	Tls_СертификатИзменен = Истина;
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ApiKey_ЗначениеПриИзменении(Элемент)
	
	ApiKey_ЗначениеИзменено = Истина;
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПароль(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	// Переключаем режим пароля
	Элемент.РежимПароля = НЕ Элемент.РежимПароля;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьТипАвторизацииПоУмолчанию()
	
	Если НЕ ЗначениеЗаполнено(Объект.ТипАвторизации) Тогда
		Объект.ТипАвторизации = Перечисления.инт_ТипыАвторизации.Анонимный;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ИмяСтраницыПоТипуАвторизации(ТипАвторизации)
	
	СтраницаПоТипу = Новый Соответствие;
	СтраницаПоТипу.Вставить("Анонимный", "СтраницаАнонимный");
	СтраницаПоТипу.Вставить("Basic", "СтраницаBasic");
	СтраницаПоТипу.Вставить("Digest", "СтраницаDigest");
	СтраницаПоТипу.Вставить("Bearer", "СтраницаBearer");
	СтраницаПоТипу.Вставить("Tls", "СтраницаTls");
	СтраницаПоТипу.Вставить("ApiKey", "СтраницаApiKey");
	СтраницаПоТипу.Вставить("API Key", "СтраницаApiKey");
	
	ИмяСтраницы = СтраницаПоТипу.Получить(Строка(ТипАвторизации));
	Если ИмяСтраницы = Неопределено Тогда
		ИмяСтраницы = "СтраницаАнонимный";
	КонецЕсли;
	
	Возврат ИмяСтраницы;
	
КонецФункции

&НаСервере
Процедура ОбновитьВидимостьСтраницАвторизацииНаСервере()
	
	ИмяСтраницы = ИмяСтраницыПоТипуАвторизации(Объект.ТипАвторизации);
	Элементы.СтраницыАвторизация.ТекущаяСтраница = Элементы[ИмяСтраницы];
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьСтраницАвторизации()
	
	ИмяСтраницы = ИмяСтраницыПоТипуАвторизации(Объект.ТипАвторизации);
	Элементы.СтраницыАвторизация.ТекущаяСтраница = Элементы[ИмяСтраницы];
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьГруппСертификата()
	
	// 0 - Загрузить файл, 1 - Хранилище Windows
	Элементы.ГруппаСертификатЗагрузка.Видимость = (Tls_ИсточникСертификата = 0);
	Элементы.ГруппаСертификатХранилище.Видимость = (Tls_ИсточникСертификата = 1);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьГруппСертификатаНаСервере()
	
	// 0 - Загрузить файл, 1 - Хранилище Windows
	Элементы.ГруппаСертификатЗагрузка.Видимость = (Tls_ИсточникСертификата = 0);
	Элементы.ГруппаСертификатХранилище.Видимость = (Tls_ИсточникСертификата = 1);
	
	// Обновить надпись о статусе загрузки
	Если Tls_СертификатЗагружен Тогда
		Элементы.НадписьСертификатЗагружен.Заголовок = "✓ Сертификат загружен";
	Иначе
		Элементы.НадписьСертификатЗагружен.Заголовок = "Сертификат не загружен";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗначенияИзБезопасногоХранилища()
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	СсылкаНаЭндпоинт = Объект.Ссылка;
	
	// Basic
	Basic_Пользователь = СтрокаИзБезопасногоХранилища(ПрочитатьИзБезопасногоХранилища(СсылкаНаЭндпоинт, "Basic_Пользователь"));
	ПарольИзХранилища = ПрочитатьИзБезопасногоХранилища(СсылкаНаЭндпоинт, "Basic_Пароль");
	Basic_Пароль = ?(ЗначениеЗаполнено(ПарольИзХранилища), Строка(УникальныйИдентификатор), "");
	
	// Digest
	Digest_Пользователь = СтрокаИзБезопасногоХранилища(ПрочитатьИзБезопасногоХранилища(СсылкаНаЭндпоинт, "Digest_Пользователь"));
	DigestПарольИзХранилища = ПрочитатьИзБезопасногоХранилища(СсылкаНаЭндпоинт, "Digest_Пароль");
	Digest_Пароль = ?(ЗначениеЗаполнено(DigestПарольИзХранилища), Строка(УникальныйИдентификатор), "");
	
	// Bearer
	ТокенИзХранилища = ПрочитатьИзБезопасногоХранилища(СсылкаНаЭндпоинт, "Bearer_Токен");
	Bearer_Токен = ?(ЗначениеЗаполнено(ТокенИзХранилища), Строка(УникальныйИдентификатор), "");
	
	// TLS
	СертификатПарольИзХранилища = ПрочитатьИзБезопасногоХранилища(СсылкаНаЭндпоинт, "Tls_СертификатПароль");
	Tls_СертификатПароль = ?(ЗначениеЗаполнено(СертификатПарольИзХранилища), Строка(УникальныйИдентификатор), "");
	Tls_СертификатХранилище = СтрокаИзБезопасногоХранилища(ПрочитатьИзБезопасногоХранилища(СсылкаНаЭндпоинт, "Tls_СертификатХранилище"));
	СертификатДанныеИзХранилища = ПрочитатьИзБезопасногоХранилища(СсылкаНаЭндпоинт, "Tls_СертификатДанные");
	Tls_СертификатИмяФайла = СтрокаИзБезопасногоХранилища(ПрочитатьИзБезопасногоХранилища(СсылкаНаЭндпоинт, "Tls_СертификатИмяФайла"));
	Tls_СертификатЗагружен = ЗначениеЗаполнено(СертификатДанныеИзХранилища);
	
	// Определяем источник сертификата: 0 - Загрузить файл, 1 - Хранилище Windows
	Если ЗначениеЗаполнено(Tls_СертификатХранилище) Тогда
		Tls_ИсточникСертификата = 1; // Хранилище Windows
	Иначе
		Tls_ИсточникСертификата = 0; // Загрузить файл (по умолчанию)
	КонецЕсли;
	
	// ApiKey
	ApiKey_ИмяЗаголовка = СтрокаИзБезопасногоХранилища(ПрочитатьИзБезопасногоХранилища(СсылкаНаЭндпоинт, "ApiKey_ИмяЗаголовка"));
	ЗначениеКлючаИзХранилища = ПрочитатьИзБезопасногоХранилища(СсылкаНаЭндпоинт, "ApiKey_Значение");
	ApiKey_Значение = ?(ЗначениеЗаполнено(ЗначениеКлючаИзХранилища), Строка(УникальныйИдентификатор), "");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СтрокаИзБезопасногоХранилища(Значение)
	
	Если Значение = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат Строка(Значение);
	
КонецФункции

&НаСервере
Процедура СохранитьДанныеВБезопасноеХранилище(СсылкаНаЭндпоинт)
	
	ТипАвторизации = Объект.ТипАвторизации;
	
	Если ТипАвторизации = Перечисления.инт_ТипыАвторизации.Basic Тогда
		СохранитьДанныеBasic(СсылкаНаЭндпоинт);
	ИначеЕсли ТипАвторизации = Перечисления.инт_ТипыАвторизации.Digest Тогда
		СохранитьДанныеDigest(СсылкаНаЭндпоинт);
	ИначеЕсли ТипАвторизации = Перечисления.инт_ТипыАвторизации.Bearer Тогда
		СохранитьДанныеBearer(СсылкаНаЭндпоинт);
	ИначеЕсли ТипАвторизации = Перечисления.инт_ТипыАвторизации.Tls Тогда
		СохранитьДанныеTls(СсылкаНаЭндпоинт);
	ИначеЕсли ТипАвторизации = Перечисления.инт_ТипыАвторизации.ApiKey Тогда
		СохранитьДанныеApiKey(СсылкаНаЭндпоинт);
	Иначе
		Возврат; // Анонимный или неизвестный тип - ничего не сохраняем
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьДанныеBasic(СсылкаНаЭндпоинт)
	
	ЗаписатьВБезопасноеХранилище(СсылкаНаЭндпоинт, "Basic_Пользователь", Basic_Пользователь);
	
	Если Basic_ПарольИзменен Тогда
		ЗаписатьВБезопасноеХранилище(СсылкаНаЭндпоинт, "Basic_Пароль", Basic_Пароль);
		Basic_Пароль = ?(ЗначениеЗаполнено(Basic_Пароль), УникальныйИдентификатор, "");
		Basic_ПарольИзменен = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьДанныеDigest(СсылкаНаЭндпоинт)
	
	ЗаписатьВБезопасноеХранилище(СсылкаНаЭндпоинт, "Digest_Пользователь", Digest_Пользователь);
	
	Если Digest_ПарольИзменен Тогда
		ЗаписатьВБезопасноеХранилище(СсылкаНаЭндпоинт, "Digest_Пароль", Digest_Пароль);
		Digest_Пароль = ?(ЗначениеЗаполнено(Digest_Пароль), УникальныйИдентификатор, "");
		Digest_ПарольИзменен = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьДанныеBearer(СсылкаНаЭндпоинт)
	
	Если Bearer_ТокенИзменен Тогда
		ЗаписатьВБезопасноеХранилище(СсылкаНаЭндпоинт, "Bearer_Токен", Bearer_Токен);
		Bearer_Токен = ?(ЗначениеЗаполнено(Bearer_Токен), УникальныйИдентификатор, "");
		Bearer_ТокенИзменен = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьДанныеTls(СсылкаНаЭндпоинт)
	
	Если НЕ Tls_СертификатИзменен Тогда
		Возврат;
	КонецЕсли;
	
	// Очищаем все варианты перед записью нового
	ЗаписатьВБезопасноеХранилище(СсылкаНаЭндпоинт, "Tls_СертификатХранилище", "");
	ЗаписатьВБезопасноеХранилище(СсылкаНаЭндпоинт, "Tls_СертификатДанные", "");
	ЗаписатьВБезопасноеХранилище(СсылкаНаЭндпоинт, "Tls_СертификатИмяФайла", "");
	ЗаписатьВБезопасноеХранилище(СсылкаНаЭндпоинт, "Tls_СертификатПароль", "");
	
	Если Tls_ИсточникСертификата = 0 Тогда
		// Загруженный файл
		ЗаписатьВБезопасноеХранилище(СсылкаНаЭндпоинт, "Tls_СертификатДанные", Tls_СертификатДанные);
		ЗаписатьВБезопасноеХранилище(СсылкаНаЭндпоинт, "Tls_СертификатИмяФайла", Tls_СертификатИмяФайла);
		ЗаписатьВБезопасноеХранилище(СсылкаНаЭндпоинт, "Tls_СертификатПароль", Tls_СертификатПароль);
	ИначеЕсли Tls_ИсточникСертификата = 1 Тогда
		// Хранилище Windows
		ЗаписатьВБезопасноеХранилище(СсылкаНаЭндпоинт, "Tls_СертификатХранилище", Tls_СертификатХранилище);
	КонецЕсли;
	
	Tls_СертификатПароль = ?(ЗначениеЗаполнено(Tls_СертификатПароль), УникальныйИдентификатор, "");
	Tls_СертификатИзменен = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьДанныеApiKey(СсылкаНаЭндпоинт)
	
	ЗаписатьВБезопасноеХранилище(СсылкаНаЭндпоинт, "ApiKey_ИмяЗаголовка", ApiKey_ИмяЗаголовка);
	
	Если ApiKey_ЗначениеИзменено Тогда
		ЗаписатьВБезопасноеХранилище(СсылкаНаЭндпоинт, "ApiKey_Значение", ApiKey_Значение);
		ApiKey_Значение = ?(ЗначениеЗаполнено(ApiKey_Значение), УникальныйИдентификатор, "");
		ApiKey_ЗначениеИзменено = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПрочитатьИзБезопасногоХранилища(Владелец, Ключ)
	
	УстановитьПривилегированныйРежим(Истина); // BSLLS:SetPrivilegedMode-off
	Результат = ИТКВ_БСП.ПрочитатьДанныеИзБезопасногоХранилища(Владелец, Ключ);
	УстановитьПривилегированныйРежим(Ложь);
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаписатьВБезопасноеХранилище(Владелец, Ключ, Значение)
	
	УстановитьПривилегированныйРежим(Истина); // BSLLS:SetPrivilegedMode-off
	ИТКВ_БСП.ЗаписатьДанныеВБезопасноеХранилище(Владелец, Значение, Ключ);
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормыСертификат

&НаКлиенте
Процедура ЗагрузитьСертификат(Команда)
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	ПараметрыДиалога.Фильтр = "Сертификаты (*.pfx, *.p12)|*.pfx;*.p12|Все файлы (*.*)|*.*";
	ПараметрыДиалога.МножественныйВыбор = Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузитьСертификатЗавершение", ЭтотОбъект);
	НачатьПомещениеФайла(ОписаниеОповещения, , , Истина, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСертификатЗавершение(Результат, АдресВХранилище, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьСертификатНаСервере(АдресВХранилище, ВыбранноеИмяФайла);
	
	Tls_СертификатИзменен = Истина;
	Tls_СертификатЗагружен = Истина;
	Модифицированность = Истина;
	
	Элементы.НадписьСертификатЗагружен.Заголовок = "✓ Сертификат загружен: " + ВыбранноеИмяФайла;
	
	ПоказатьПредупреждение(, "Сертификат успешно загружен. Не забудьте сохранить элемент.");
	
КонецПроцедуры

&НаСервере
Процедура СохранитьСертификатНаСервере(АдресВХранилище, ИмяФайла)
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВХранилище);
	СодержимоеBase64 = Base64Строка(ДвоичныеДанные);
	
	// Сохраняем во временное хранилище на форме, чтобы записать при сохранении
	Tls_СертификатДанные = СодержимоеBase64;
	Tls_СертификатИмяФайла = ИмяФайла;
	
КонецПроцедуры

#КонецОбласти
